---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericCorruption
source: html/57bc1f36-b1d5-ae2f-412f-794699064630.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericCorruption Property

A generic error has occurred.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericCorruption { get; }
```